STS-Dev-Team/android_hardware_ti_omap4xxx/test/VTC/IOMXDecoder.cpp
/*
 * Copyright (C) Texas Instruments - http://www.ti.com/
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 2.1 of the License, or (at your option) any later version.
 *
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA
 */

#include "VTCLoopback.h"
#include "IOMXDecoder.h"
#define LOG_TAG "VTC_DEC"
#define LOG_NDEBUG 0

#define NO_PORT_RECONFIG        1

//Can have '7' in all cases except 1080p slice mode when VNF is enabled and
//1080p frame mode with Vstab as we will reach Tiler 2-D boundary and alloc fails
#define MAX_OUTPUT_BUF_NUM     5

#define MAX_FRAME_WIDTH        2048 //For 1080p
#define MAX_FRAME_HEIGHT       1184 //For 1080p

#define MAX_FRAME_WIDTH_720P        1408 //For 720p
#define MAX_FRAME_HEIGHT_720P       832  //For 720p

#define MY_LOGV(x, ...) LOGV(x, ##__VA_ARGS__)

using namespace android;


static void PrintDecoderFPS() {
    static int mFrameCount = 0;
    static int mLastFrameCount = 0;
    static nsecs_t mLastFpsTime = 0;
    static float mFps = 0;
    mFrameCount++;
    if (!(mFrameCount & 0x1F)) {
        nsecs_t now = systemTime();
        nsecs_t diff = now - mLastFpsTime;
        mFps = ((mFrameCount - mLastFrameCount) * float(s2ns(1))) / diff;
        mLastFpsTime = now;
        mLastFrameCount = mFrameCount;
        LOGD("Decoder: %d Frames, %f FPS", mFrameCount, mFps);
    }
    // XXX: mFPS has the value we want
}

static void PrintVTCLatency(nsecs_t ts) {
    static int mFrameCount = 0;
    static int64_t sum_latency_ms = 0;
    int64_t now, diff_ms, avg_latency;

    now = systemTime()/1000;
    diff_ms = (now - ts) / 1000;
    sum_latency_ms += diff_ms;
    mFrameCount++;
    if (!(mFrameCount & 0x1F)) {
        avg_latency = sum_latency_ms / 32;
        sum_latency_ms = 0;
        LOGD("Avg Latency: %d Frames, %llu ms", mFrameCount, avg_latency);
    }
}

bool OMXDecoder::SourceHandler::Handler() {
    MY_LOGV("\n SourceHandler::Handler \n");
    Ti::Utils::Message msg;
    volatile int forever = 1;

    while(forever) {
        Ti::Utils::MessageQueue::waitForMsg(&mCommandMsgQ, NULL, NULL, -1);
        {
            Mutex::Autolock lock(mLock);
            mCommandMsgQ.get(&msg);
        }

        switch ( msg.command ) {
            case SourceHandler::COMMAND_PROCESS_MSG: {
                InPortBufferInfo *info = (InPortBufferInfo *)(msg.arg1);
                mOMXDecoder->drainInputBuffer(info);
                break;
            }
            case SourceHandler::COMMAND_EXIT: {
                LOGD("Exiting OMX callback handler");
                forever = 0;
                break;
            }
        }
    }
    return false;
}


bool OMXDecoder::OMXCallbackHandler::Handler() {
    MY_LOGV("\n OMXCallbackHandler::Handler \n");
    Ti::Utils::Message msg;
    volatile int forever = 1;

    while(forever) {
        Ti::Utils::MessageQueue::waitForMsg(&mCommandMsgQ, NULL, NULL, -1);
        {
            Mutex::Autolock lock(mLock);
            mCommandMsgQ.get(&msg);
        }

        switch ( msg.command ) {
            case OMXCallbackHandler::COMMAND_PROCESS_MSG: {
                omx_message *om = (omx_message*)(msg.arg1);
                omx_message omsg = *om;
                mOMXDecoder->on_message(omsg);
                break;
            }
            case OMXCallbackHandler::COMMAND_EXIT: {
                LOGD("Exiting OMX callback handler");
                forever = 0;
                break;
            }
        }
    }
    return false;
}


OMXDecoder::OMXDecoder(int width, int height, int framerate):
        mWidth(width),
        mHeight(height),
        mFrameRate(framerate),
        mAcceptingBuffers(0),
        mPortReconfigInProgress(false),
        mSizeOfAllAllocatedOutputBuffers(0) {

}

OMXDecoder::~OMXDecoder() {

}

void OMXDecoder::on_message(const omx_message &msg) {
    switch (msg.type) {
        case omx_message::EVENT:
            EventHandler(msg.u.event_data.event, msg.u.event_data.data1, msg.u.event_data.data2);
            break;
        case omx_message::EMPTY_BUFFER_DONE:
            EmptyBufferDone((OMX_BUFFERHEADERTYPE*)msg.u.extended_buffer_data.buffer);
            break;
        case omx_message::FILL_BUFFER_DONE:
            PrintVTCLatency(msg.u.extended_buffer_data.timestamp);
            FillBufferDone((OMX_BUFFERHEADERTYPE*)msg.u.extended_buffer_data.buffer);
            break;
        default:
            CHECK(!"############ Corrupted Message !!! #############");
            break;
    }
}

status_t OMXDecoder::configure(OMX_VIDEO_AVCPROFILETYPE profile, OMX_VIDEO_AVCLEVELTYPE level, OMX_U32 refFrames) {
    status_t err;
    LOG_FUNCTION_NAME_ENTRY

    createPlaybackSurface();

    CHECK_EQ(mOMXClient.connect(), (status_t)OK);
    mOMX = mOMXClient.interface();
    mNode = 0;
    mObserver = new OMXDecoderObserver();
    err = mOMX->allocateNode("OMX.TI.DUCATI1.VIDEO.DECODER", mObserver, &mNode);
    if (err != OK) {
        LOGD("Failed to allocate OMX node!!");
        return -1;
    }
    mObserver->setCodec(this);

    // initialize omx callback handling thread
    if(mOMXCallbackHandler.get() == NULL)
        mOMXCallbackHandler = new OMXCallbackHandler(this);

    if ( NULL == mOMXCallbackHandler.get() ) {
        LOGE("Couldn't create omx callback handler");
        return -1;
    }

    err = mOMXCallbackHandler->run("OMXCallbackThread", PRIORITY_URGENT_DISPLAY);
    if ( err != NO_ERROR ) {
        if( err == INVALID_OPERATION) {
            LOGE("omx callback handler thread already runnning!!");
            err = NO_ERROR;
        } else {
            LOGE("Couldn't run omx callback handler thread");
            return -1;
        }
    }

