STS-Dev-Team/android_hardware_ti_omap4xxx/test/VTC/IOMXDecoder.cpp
    // initialize source handling thread
    if(mSourceHandler.get() == NULL)
        mSourceHandler = new SourceHandler(this);

    if ( NULL == mSourceHandler.get() ) {
        LOGE("Couldn't create source handler");
        return -1;
    }

    err = mSourceHandler->run("SourceThread", PRIORITY_URGENT_DISPLAY);
    if ( err != NO_ERROR ) {
        if( err == INVALID_OPERATION) {
            LOGE("source handler thread already runnning!!");
            err = NO_ERROR;
        } else {
            LOGE("Couldn't run source handler thread");
            return -1;
        }
    }

    mState = OMX_StateLoaded;
    waitForStateChange = 0;

    OMX_VIDEO_PARAM_PORTFORMATTYPE format;
    INIT_OMX_STRUCT(&format, OMX_VIDEO_PARAM_PORTFORMATTYPE);
    bool found = false;
    OMX_U32 index = 0;
    format.nPortIndex = OUTPUT_PORT;
    format.nIndex = 0;
    for (;;) {
        format.nIndex = index;
        err = mOMX->getParameter(mNode, OMX_IndexParamVideoPortFormat, &format, sizeof(format));
        if (err != OK) {
            LOGD( "get OMX_IndexParamVideoPortFormat OutPort Error:%d", err);
            return -1;
        }

        if (format.eCompressionFormat == OMX_VIDEO_CodingUnused
                && format.eColorFormat == (OMX_TI_COLOR_FormatYUV420PackedSemiPlanar)) {
            found = true;
            break;
        }
        ++index;
    }

    if (!found) {
        LOGE("Did not find a match.");
        return -1;
    }

    MY_LOGV("found a match.");
    err = mOMX->setParameter(mNode, OMX_IndexParamVideoPortFormat, &format, sizeof(format));
    if (err != OK) {
        LOGD( "set OMX_IndexParamVideoPortFormat OutPort Error:%d", err);
        return -1;
    }

    //
    // Populate Video input Port
    //
    INIT_OMX_STRUCT(&tInPortDef, OMX_PARAM_PORTDEFINITIONTYPE);

    tInPortDef.nPortIndex = INPUT_PORT;
    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition, &tInPortDef, sizeof(tInPortDef));
    if (err != OK) {
        LOGD( "get OMX_IndexParamPortDefinition InPort Error:%d", err);
        return -1;
    }

    tInPortDef.format.video.nFrameWidth = mWidth;
    tInPortDef.format.video.nFrameHeight = mHeight;
    tInPortDef.format.video.eCompressionFormat = OMX_VIDEO_CodingAVC;
    tInPortDef.nBufferCountActual = 4; // better to match this with the number of encoder output buffers
    tInPortDef.nBufferSize = (mWidth * mHeight);
    err = mOMX->setParameter(mNode, OMX_IndexParamPortDefinition, &tInPortDef, sizeof(tInPortDef));
    if (err != OK) {
        LOGD( "set OMX_IndexParamPortDefinition InPort Error:%d", err);
        return -1;
    }

    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition, &tInPortDef, sizeof(tInPortDef));
    if (err != OK) {
        LOGD("get OMX_IndexParamPortDefinition InPort Error:%d", err);
        return -1;
    }

    //
    // Populate Video output Port
    //
    INIT_OMX_STRUCT(&tOutPortDef, OMX_PARAM_PORTDEFINITIONTYPE);
    tOutPortDef.nPortIndex = OUTPUT_PORT;
    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition,&tOutPortDef, sizeof(tOutPortDef));
    if (err != OK) {
        LOGD("get OMX_IndexParamPortDefinition OutPort Error:%d", err);
        return -1;
    }

    tOutPortDef.format.video.nFrameWidth = mWidth;
    tOutPortDef.format.video.nFrameHeight = mHeight;
    tOutPortDef.format.video.nStride = 4096;
    tOutPortDef.format.video.xFramerate = (mFrameRate << 16);
    tOutPortDef.format.video.eColorFormat = OMX_COLOR_FormatYUV420PackedSemiPlanar;
//    tOutPortDef.nBufferCountActual += 2; // 2 for surface flinger.
    //set buffer count such that port reconfig can be avoided..
    //is that possible? in any case add 2 for surface flinger.

    err = mOMX->setParameter(mNode, OMX_IndexParamPortDefinition, &tOutPortDef, sizeof(tOutPortDef));
    if (err != OK) {
        LOGD( "set OMX_IndexParamPortDefinition OutPort Error:%d", err);
        return -1;
    }

    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition,&tOutPortDef, sizeof(tOutPortDef));
    if (err != OK) {
        LOGD("get OMX_IndexParamPortDefinition OutPort Error:%d", err);
        return -1;
    }

    //
    // setup (code specific) AVC Decoder paramters
    //
    OMX_VIDEO_PARAM_AVCTYPE h264type;
    INIT_OMX_STRUCT(&h264type,OMX_VIDEO_PARAM_AVCTYPE);
    h264type.nPortIndex = INPUT_PORT;

    err = mOMX->getParameter(mNode, OMX_IndexParamVideoAvc, &h264type, sizeof(h264type));
    if (err != OK) {
        LOGD("get OMX_IndexParamVideoAvc failed : %d", err);
        return -1;
    }

    h264type.eProfile = profile;
    h264type.eLevel = level;
    h264type.nRefFrames = refFrames;

    err = mOMX->setParameter(mNode, OMX_IndexParamVideoAvc, &h264type, sizeof(h264type));
    if (err != OK) {
        LOGD("set OMX_IndexParamVideoAvc failed : %d", err);
        return -1;
    }

    // Native Window related calls
    err = mOMX->enableGraphicBuffers(mNode, OUTPUT_PORT, OMX_TRUE);
    if (err != 0) {
        return err;
    }

    android_native_rect_t crop;
    crop.left = 0;
    crop.top = 0;
    crop.right = mWidth + 1;
    crop.bottom = mHeight + 1;

    // We'll ignore any errors here, if the surface is
    // already invalid, we'll know soon enough.
    native_window_set_crop(mNativeWindow.get(), &crop);

    LOG_FUNCTION_NAME_EXIT

    return 0;

}

status_t OMXDecoder::prepare() {
    status_t err;

    LOG_FUNCTION_NAME_ENTRY

    if (setCurrentState(OMX_StateIdle)) {
        return -1;
    }

    INIT_OMX_STRUCT(&tInPortDef, OMX_PARAM_PORTDEFINITIONTYPE);
    tInPortDef.nPortIndex = INPUT_PORT;
    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition, &tInPortDef, sizeof(tInPortDef));
    if (err != OK) {
        LOGD("get OMX_IndexParamPortDefinition InPort Error:%d", err);
        return -1;
    }
    //dump_video_port_values(tInPortDef);

    mDealer = new MemoryDealer((tInPortDef.nBufferCountActual*tInPortDef.nBufferSize), "PLAYBACK_INPUT");
    for (OMX_U32 i = 0; i < tInPortDef.nBufferCountActual; ++i) {
        sp<IMemory> mMem = mDealer->allocate(tInPortDef.nBufferSize);
        CHECK(mMem.get() != NULL);
        IOMX::buffer_id buffer;
        err = mOMX->allocateBufferWithBackup(mNode, INPUT_PORT, mMem, &buffer);
        if (err != OK) {
            LOGD("OMX_AllocateBuffer for input port index:%d failed:%d",(int)i,err);
        }
        InPortBufferInfo *info = new InPortBufferInfo;
        info->mem = mMem;
        info->b_id = buffer;
        mInputBuffers.push(info);
        mEmptyInputBuffers.push_back(info);
    }
    LOGD( "Allocated %d Input port Buffers. ", (int)tInPortDef.nBufferCountActual);


