STS-Dev-Team/android_hardware_ti_omap4xxx/test/VTC/IOMXDecoder.cpp
    INIT_OMX_STRUCT(&tOutPortDef, OMX_PARAM_PORTDEFINITIONTYPE);
    tOutPortDef.nPortIndex = OUTPUT_PORT;
    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition, &tOutPortDef, sizeof(tOutPortDef));
    if (err != OK) {
        LOGD("get OMX_IndexParamPortDefinition OutPort Error:%d", err);
        return -1;
    }
    //dump_video_port_values(tOutPortDef);

    err = allocateOutputBuffersFromNativeWindow();
    if (err != OK) {
        LOGD("allocateOutputBuffersFromNativeWindow failed. err:%d", err);
        return -1;
    }

    // now wait until state becomes idle.
    if (waitForStateSet(OMX_StateIdle)) {
        LOGD("state change to IDLE failed");
        return -1;
    }

    // now transition to exec
    if (setCurrentState(OMX_StateExecuting)) {
        return -1;
    }

    if (waitForStateSet(OMX_StateExecuting)) {
        LOGD("state change to EXECUTING failed");
        return -1;
    }

    if (restart() != 0) return -1;

    return 0;
}

status_t OMXDecoder::restart() {
    status_t err;
    LOG_FUNCTION_NAME_ENTRY

    // give output buffers to the OMX
    for (int i=0; i<tOutPortDef.nBufferCountActual; i++) {
        if (mOutputBuffers[i].mStatus == OWNED_BY_US) {
            err = mOMX->fillBuffer(mNode, mOutputBuffers[i].b_id);
            if (err != OK) {
                LOGD("fillBuffer failed:%d", err);
            }
            else LOGD("called fillBuffer(%d)",i);
        }
    }

    return 0;
}

status_t OMXDecoder::start(MetaData *params) {
    LOG_FUNCTION_NAME_ENTRY
    mAcceptingBuffers = 1;
    return 0;
}

status_t OMXDecoder::stop() {
    status_t err;

    LOG_FUNCTION_NAME_ENTRY

    mAcceptingBuffers = 0;
    // flush all the buffers
    err = mOMX->sendCommand(mNode,OMX_CommandFlush, INPUT_PORT);
    if (err != OK) {
        LOGD("OMX_CommandFlush for input port (0) failed:%d", err);
    }

    err = mOMX->sendCommand(mNode,OMX_CommandFlush, OUTPUT_PORT);
    if (err != OK) {
        LOGD("OMX_CommandFlush for output port (1) failed:%d", err);
    }

    // change state to Idle if not already
    if (mState != OMX_StateIdle && mState != OMX_StateLoaded) {
        if (setCurrentState(OMX_StateIdle)) {
            LOGD("OMX_StateIdle failed");
        }

        if (waitForStateSet(OMX_StateIdle)) {
            LOGD("state change to IDLE failed");
        }
    }

    // disable ports
    err = mOMX->sendCommand(mNode, OMX_CommandPortDisable, -1);
    if (err != OK) {
        LOGD("Error in SendCommand()-OMX_CommandPortDisable:");
    } else {
        LOGD("OMX_CommandPortDisable done");
    }

    // free input buffers
    for (int i=0; i<(int)tInPortDef.nBufferCountActual; i++) {
        err = mOMX->freeBuffer(mNode, INPUT_PORT, mInputBuffers[i]->b_id);
        if( (err != OK)) {
            LOGD("Free Buffer for Input Port buffer:%d failed:%d",i,err);
        }
    }

    freeOutputBuffers();

    // change state to Loaded
    if (mState != OMX_StateLoaded) {
        if (setCurrentState(OMX_StateLoaded)) {
            LOGD("OMX_StateLoaded failed");
        }
        if (waitForStateSet(OMX_StateLoaded)) {
            LOGD("state change to LOADED failed");
        }
    } else {
        LOGD("It was already OMX_StateLoaded???");
    }


    usleep(5000);

    err = mOMX->freeNode(mNode);
    CHECK_EQ(err, (status_t)OK);

    LOGD("OMX_FreeHandle completed");

    //Exit and free ref to callback handling thread
    if ( NULL != mOMXCallbackHandler.get() ) {
        Ti::Utils::Message msg;
        msg.command = OMXCallbackHandler::COMMAND_EXIT;
        //Clear all messages pending first
        mOMXCallbackHandler->clearCommandQ();
        mOMXCallbackHandler->put(&msg);
        mOMXCallbackHandler->requestExitAndWait();
        mOMXCallbackHandler.clear();
    }

    //Exit and free ref to source handling thread
    if ( NULL != mSourceHandler.get() ) {
        Ti::Utils::Message msg;
        msg.command = SourceHandler::COMMAND_EXIT;
        //Clear all messages pending first
        mSourceHandler->clearCommandQ();
        mSourceHandler->put(&msg);
        mSourceHandler->requestExitAndWait();
        mSourceHandler.clear();
    }

    destroyPlaybackSurface();

    //what else needs to be freed..

    return 0;
}

sp<MetaData> OMXDecoder::getFormat() {
    return NULL;
}

status_t OMXDecoder::read(MediaBuffer **buffer, const ReadOptions *options) {
    return 0;
}

void OMXDecoder::AcceptEncodedBuffer(void *pBuffer, OMX_U32 nFilledLen, OMX_TICKS nTimeStamp) {
    //MY_LOGV("AcceptEncodedBuffer - Len = %d", nFilledLen);
    if (mEmptyInputBuffers.empty()) {
        LOGE("\n\n\n Ran out of input buffers. Dropping Frames.\n\n\n");
        return;
    }

    if (mPortReconfigInProgress) {
        MY_LOGV( "%s:\t mPortReconfigInProgress.", __FUNCTION__);
        //return;
    }

    while(mPortReconfigInProgress) sleep(1);

    List<InPortBufferInfo*>::iterator iter;
    InPortBufferInfo *info;
    iter = mEmptyInputBuffers.begin();
    info = (InPortBufferInfo *)*iter;
    mEmptyInputBuffers.erase(iter);

    info->nFilledLen = nFilledLen;
    info->nTimeStamp = nTimeStamp;
    memcpy((void*)info->mem->pointer(), pBuffer, nFilledLen);

    Ti::Utils::Message msg;
    msg.command = SourceHandler::COMMAND_PROCESS_MSG;
    msg.arg1 = (void*)info;
    mSourceHandler->put(&msg);

}

OMX_ERRORTYPE OMXDecoder::EventHandler(OMX_EVENTTYPE eEvent, OMX_U32 nData1,OMX_U32 nData2) {
    OMX_ERRORTYPE errorType;
    MY_LOGV("########## EventHandler: eEvent:0x%x, nData1:0x%x, nData2:0x%x, pid=%d", (int)eEvent, (int)nData1, (int)nData2, getpid());

    switch (eEvent) {
        case OMX_EventCmdComplete:
            if (nData1 == OMX_CommandPortDisable) {
                if (nData2 == OMX_DirInput) {
                    LOGD( "Component OMX_EventCmdComplete OMX_CommandPortDisable OMX_DirInput");
                }
                if (nData2 == OMX_DirOutput) {
                    LOGD( "Component OMX_EventCmdComplete OMX_CommandPortDisable OMX_DirOutput");
                    if (mPortReconfigInProgress) {
                        status_t err = mOMX->sendCommand(mNode, OMX_CommandPortEnable, OUTPUT_PORT);
                        CHECK_EQ(err, (status_t)OK);
                        allocateOutputBuffersFromNativeWindow();
                    }
                }
            } else if (nData1 == OMX_CommandPortEnable) {
                if (nData2 == OUTPUT_PORT) {
                    LOGD( "Component OMX_EventCmdComplete OMX_CommandPortEnable OMX_DirOutput");
                    restart();
                    mPortReconfigInProgress = false;
                    LOGD("\nPort Reconfiguration completed.. \n");

