STS-Dev-Team/android_hardware_ti_omap4xxx/test/VTC/IOMXDecoder.cpp
                }
            } else if (nData1 == OMX_CommandStateSet) {
                LOGD( "Component OMX_EventCmdComplete OMX_CommandStateSet new State:%s",OMXStateName((OMX_STATETYPE)nData2));
                {
                    Mutex::Autolock autoLock(mLock);
                    mState = (OMX_STATETYPE)nData2;
                    waitForStateChange = 0;
                }
                mAsyncCompletion.signal();

            } else if (nData1 == OMX_CommandFlush) {
                LOGD( "Component OMX_EventCmdComplete OMX_CommandFlush port:%d",(int)nData2);
            } else {
                LOGD( "Component OMX_EventCmdComplete command:%d",(int)nData1);
            }
            break;

        case OMX_EventPortSettingsChanged:
            if (nData2 == 0 || nData2 == OMX_IndexParamPortDefinition) {
                LOGD("\nPort Reconfiguration in progress.. \n");
                mPortReconfigInProgress = true;
                status_t err = mOMX->sendCommand(mNode, OMX_CommandPortDisable, nData1);
                CHECK_EQ(err, (status_t)OK);

                freeOutputBuffers();
            } else if ((nData1 == OUTPUT_PORT)&& (nData2 == OMX_IndexConfigCommonOutputCrop)) {

                OMX_CONFIG_RECTTYPE rect;
                INIT_OMX_STRUCT(&rect, OMX_CONFIG_RECTTYPE);
                rect.nPortIndex = OUTPUT_PORT;
                status_t err = mOMX->getConfig(mNode, OMX_IndexConfigCommonOutputCrop, &rect, sizeof(rect));

                if (err == OK) {
                    LOGI("Crop rect is %ld x %ld @ (%ld, %ld)", rect.nWidth, rect.nHeight, rect.nLeft, rect.nTop);

                    android_native_rect_t crop;
                    crop.left = rect.nLeft;
                    crop.top = rect.nTop;
                    crop.right = rect.nLeft + rect.nWidth;
                    crop.bottom = rect.nTop + rect.nHeight;

                    native_window_set_crop(mNativeWindow.get(), &crop);
                }
            } else {
                LOGD("\n\nNOT PROCESSING THIS OMX_EventPortSettingsChanged EVENT: nData1 = 0x%x, nData2 = 0x%x\n\n", nData1, nData2);
            }
            break;

        case OMX_EventError:
            errorType = (OMX_ERRORTYPE) nData1;
            LOGD( "\n\n\nComponent OMX_EventError error:%x\n\n\n",errorType);
            break;

        default:
            break;
    }

    LOG_FUNCTION_NAME_EXIT
    return OMX_ErrorNone;
}

status_t OMXDecoder::FillBufferDone(OMX_BUFFERHEADERTYPE* pBufferHdr) {
    status_t err;

    OMX_U32 i=0;

    //LOG_FUNCTION_NAME_ENTRY

    // not mAcceptingBuffers, just return, eventually, decoder will stop
    if (mAcceptingBuffers == 0) {
        MY_LOGV( " in non mAcceptingBuffers mode");
        return OMX_ErrorNone;
    }

    if (mPortReconfigInProgress) {
        MY_LOGV( "%s:\t mPortReconfigInProgress", __FUNCTION__);
        return OMX_ErrorNone;
    }

    int sz = tOutPortDef.nBufferCountActual;
    for (i = 0; i < sz; i++) {
        if (pBufferHdr == mOutputBuffers[i].b_id) {
            break;
        }
    }

    if (i == sz) {
        LOGE("FillBufferDone returned unknown buffer header! i=%d",(int)i);
        return -1;
    }
    //LOGD( "----- %d ----- ", (int)i);
    PortBufferInfo *info = &mOutputBuffers.editItemAt(i);
    info->mStatus = OWNED_BY_US;

    err = mNativeWindow->queueBuffer(mNativeWindow.get(), mOutputBuffers[i].gb.get());
    if (err != 0) {
        LOGE("queueBuffer failed with error %s (%d)", strerror(-err), -err);
        return -1;
    }
    info->mStatus = OWNED_BY_NATIVE_WINDOW;

    if (mDebugFlags & FPS_DECODER) PrintDecoderFPS();

    ANativeWindowBuffer* buf;
    err = mNativeWindow->dequeueBuffer(mNativeWindow.get(), &buf);
    if (err != 0) {
        LOGE("dequeueBuffer failed w/ error 0x%08x", err);
        return -1;
    }

    for (i = 0; i < sz; i++) {
        if (mOutputBuffers[i].gb->handle == buf->handle) {
            break;
        }
    }

    if (i == sz) {
        LOGE("FillBufferDone returned unknown buffer header! i=%d",(int)i);
        return -1;
    }

    info = &mOutputBuffers.editItemAt(i);
    info->mStatus = OWNED_BY_US;

    err = mOMX->fillBuffer(mNode, mOutputBuffers[i].b_id);
    if (err != OK) {
        LOGE("OMX_FillThisBuffer failed:%d", err);
    }
    info->mStatus = OWNED_BY_COMPONENT;

    //mBufferCount++;
    //MY_LOGV("EXIT FillBufferDone: nFilledLen=%d, mBufferCount=%d", nFilledLen, mBufferCount);

    return OMX_ErrorNone;
}

status_t OMXDecoder::EmptyBufferDone(OMX_BUFFERHEADERTYPE* pBufferHdr) {
    status_t err;
    OMX_U32 i=0;
    //LOG_FUNCTION_NAME_ENTRY

    // not mAcceptingBuffers, just return, eventually, decoder will stop
    if (mAcceptingBuffers == 0) {
        MY_LOGV( " in non mAcceptingBuffers mode");
        return OMX_ErrorNone;
    }

    int sz = mInputBuffers.size();
    for (i = 0; i < sz; i++) {
        if (pBufferHdr == mInputBuffers[i]->b_id)
            break;
    }

    if (i == sz) {
        LOGE("EmptyBufferDone returned unknown buffer header! i=%d",(int)i);
        return -1;
    }

    mEmptyInputBuffers.push_back(mInputBuffers[i]);

    //LOG_FUNCTION_NAME_EXIT

    return err;
}

status_t OMXDecoder::setCurrentState(OMX_STATETYPE newState) {
    LOGD("Attempting to set state to %s.", OMXStateName(newState));

    status_t err = mOMX->sendCommand(mNode, OMX_CommandStateSet, newState);
    if (err != OK) {
        LOGD("setCurrentState: Error:%d", err);
        return -1;
    }

    LOG_FUNCTION_NAME_EXIT
    return 0;
}

status_t OMXDecoder::waitForStateSet(OMX_STATETYPE newState) {
    LOGD("ENTER waitForStateSet: Waiting to move to state %s .....", OMXStateName(newState));

    if (newState == mState) {
        LOGD("New State [%s] already set!", OMXStateName(newState));
        return 0;
    }

    status_t retval = mAsyncCompletion.waitRelative(mLock, TWO_SECOND);
    if (retval) {
        LOGD("mAsyncCompletion.waitRelative RETURNED %d", retval);
        if (errno == ETIMEDOUT) {
            LOGD("$$$$$$$$$$$$$$$$$$$$$$$$$$$$ Waiting for State change timed out $$$$$$$$$$$$$$$$$$$$$$$$$$$$");
            waitForStateChange = 0;
        }
    }

