STS-Dev-Team/android_hardware_ti_omap4xxx/test/VTC/IOMXDecoder.cpp
    if (newState == mState) {
        LOGD("State [%s] Set !!!!!!!!!!!!!!!!!", OMXStateName(newState));
        return 0;
    }

    LOG_FUNCTION_NAME_EXIT
    return -1;
}


status_t OMXDecoder::createPlaybackSurface() {

    mSurfaceComposerClient = new SurfaceComposerClient();
    CHECK_EQ(mSurfaceComposerClient->initCheck(), (status_t)OK);

    mSurfaceControl = mSurfaceComposerClient->createSurface(0,
                                           320, 320, HAL_PIXEL_FORMAT_RGB_565);

    mNativeWindow = mSurfaceControl->getSurface();

    mSurfaceComposerClient->openGlobalTransaction();
    mSurfaceControl->setLayer(0x7fffffff);
    mSurfaceControl->setPosition(10, 10);
    mSurfaceControl->setSize(300, 300);
    mSurfaceControl->show();
    mSurfaceComposerClient->closeGlobalTransaction();

    return 0;
}

status_t OMXDecoder::destroyPlaybackSurface() {

    if ( NULL != mNativeWindow.get() ) {
        mNativeWindow.clear();
    }

    if ( NULL != mSurfaceControl.get() ) {
        mSurfaceControl->clear();
        mSurfaceControl.clear();
    }

    if ( NULL != mSurfaceComposerClient.get() ) {
        mSurfaceComposerClient->dispose();
        mSurfaceComposerClient.clear();
    }

    return 0;
}

status_t OMXDecoder::allocateOutputBuffersFromNativeWindow() {

    status_t err;
    err = mOMX->getParameter(mNode, OMX_IndexParamPortDefinition, &tOutPortDef, sizeof(tOutPortDef));
    if (err != OK) {
        LOGD("get OMX_IndexParamPortDefinition OutPort Error:%d", err);
        return -1;
    }

    err = native_window_set_scaling_mode(mNativeWindow.get(),
            NATIVE_WINDOW_SCALING_MODE_SCALE_TO_WINDOW);

    if (err != OK) {
        return err;
    }

    OMX_U32 nBufferCnt = tOutPortDef.nBufferCountActual;
#ifdef NO_PORT_RECONFIG

    LOGD("\nO/P Buffer Reqmt: %d buffers of size %d x %d\n", tOutPortDef.nBufferCountActual, tOutPortDef.format.video.nFrameWidth, tOutPortDef.format.video.nFrameHeight);

    int newBufferRqmt = tOutPortDef.nBufferCountActual *
            tOutPortDef.format.video.nFrameWidth *
            tOutPortDef.format.video.nFrameHeight *
            3 / 2;
    bool bufferRqmtsChanged = (mSizeOfAllAllocatedOutputBuffers < newBufferRqmt) ? true : false;
    nBufferCnt = (MAX_OUTPUT_BUF_NUM > tOutPortDef.nBufferCountActual) ? MAX_OUTPUT_BUF_NUM : tOutPortDef.nBufferCountActual;

    if ((mPortReconfigInProgress == false)|| bufferRqmtsChanged ) {
        int framewidth = 0;
        int frameheight = 0;

        if (tOutPortDef.format.video.nFrameWidth > MAX_FRAME_WIDTH_720P) {
            framewidth = (tOutPortDef.format.video.nFrameWidth > MAX_FRAME_WIDTH)? tOutPortDef.format.video.nFrameWidth : MAX_FRAME_WIDTH;
        } else {
            framewidth = MAX_FRAME_WIDTH_720P;
        }

        if (tOutPortDef.format.video.nFrameHeight > MAX_FRAME_HEIGHT_720P) {
            frameheight = (tOutPortDef.format.video.nFrameHeight > MAX_FRAME_HEIGHT)? tOutPortDef.format.video.nFrameHeight : MAX_FRAME_HEIGHT;
        } else {
            frameheight = MAX_FRAME_HEIGHT_720P;
        }

        err = native_window_set_buffers_geometry(
                mNativeWindow.get(),
                framewidth,
                frameheight,
                tOutPortDef.format.video.eColorFormat);

        if (err != 0) {
            LOGE("native_window_set_buffers_geometry failed: %s (%d)",
                    strerror(-err), -err);
            return err;
        }
        mSizeOfAllAllocatedOutputBuffers = nBufferCnt * framewidth * frameheight * 3 / 2;
        LOGD("\nO/P Buffers actually allocated: %d buffers of size %d x %d\n\n", nBufferCnt, framewidth, frameheight);
    }
    else LOGI("\n---RECONFIGURING: skip native_window_set_buffers_geometry()\n");

#else
    err = native_window_set_buffers_geometry(
            mNativeWindow.get(),
            tOutPortDef.format.video.nFrameWidth,
            tOutPortDef.format.video.nFrameHeight,
            tOutPortDef.format.video.eColorFormat);

    if (err != 0) {
        LOGE("native_window_set_buffers_geometry failed: %s (%d)",
                strerror(-err), -err);
        return err;
    }

#endif

    // Set up the native window.
    OMX_U32 usage = 0;
    err = mOMX->getGraphicBufferUsage(mNode, OUTPUT_PORT, &usage);
    if (err != 0) {
        LOGW("querying usage flags from OMX IL component failed: %d", err);
        // XXX: Currently this error is logged, but not fatal.
        usage = 0;
    }

    MY_LOGV("native_window_set_usage usage=0x%lx", usage);
    err = native_window_set_usage(
            mNativeWindow.get(), usage | GRALLOC_USAGE_HW_TEXTURE | GRALLOC_USAGE_EXTERNAL_DISP);
    if (err != 0) {
        LOGE("native_window_set_usage failed: %s (%d)", strerror(-err), -err);
        return err;
    }

#ifdef NO_PORT_RECONFIG

    if ((mPortReconfigInProgress == false)|| bufferRqmtsChanged ) {
        err = native_window_set_buffer_count(mNativeWindow.get(), nBufferCnt);
        if (err != 0) {
            LOGE("native_window_set_buffer_count failed: %s (%d)", strerror(-err),
                    -err);
            return err;
        }
        LOGI("allocating %lu buffers from a native window", nBufferCnt);
    }
    else LOGI("---RECONFIGURING: skip native_window_set_buffer_count()\n\n");
#else

    err = native_window_set_buffer_count(mNativeWindow.get(), nBufferCnt);
    if (err != 0) {
        LOGE("native_window_set_buffer_count failed: %s (%d)", strerror(-err),
                -err);
        return err;
    }

    LOGI("allocating %lu buffers from a native window of size %lu on "
            "output port", tOutPortDef.nBufferCountActual, tOutPortDef.nBufferSize);

#endif

    OMX_U32 i = 0;
    // Dequeue buffers and send them to OMX
    for (i = 0; i < nBufferCnt; i++) {
        ANativeWindowBuffer* buf;
        err = mNativeWindow->dequeueBuffer(mNativeWindow.get(), &buf);
        if (err != 0) {
            LOGE("dequeueBuffer failed: %s (%d)", strerror(-err), -err);
            break;
        }

        sp<GraphicBuffer> graphicBuffer(new GraphicBuffer(buf, false));
        IOMX::buffer_id bufferId = 0;

        if (i < tOutPortDef.nBufferCountActual) {
            err = mOMX->useGraphicBuffer(mNode, OUTPUT_PORT, graphicBuffer,
                    &bufferId);
            if (err != 0) {
                LOGE("registering GraphicBuffer with OMX IL component "
                        "failed: %d", err);
                break;
            }
        }

        PortBufferInfo pbi;
        pbi.gb = graphicBuffer;
        pbi.b_id = bufferId;
        pbi.mStatus = OWNED_BY_US;
        mOutputBuffers.push(pbi);

