STS-Dev-Team/android_hardware_ti_omap4xxx/test/VTC/IOMXDecoder.cpp
        LOGI("registered graphic buffer with ID %p (pointer = %p)",
                bufferId, graphicBuffer.get());
    }

    OMX_U32 cancelStart;
    OMX_U32 cancelEnd;
    if (err != 0) {
        // If an error occurred while dequeuing we need to cancel any buffers
        // that were dequeued.
        cancelStart = 0;
        cancelEnd = i;
    } else {
        // Return the last two buffers to the native window.
        cancelStart = tOutPortDef.nBufferCountActual - 2;
        cancelEnd = tOutPortDef.nBufferCountActual;
    }

    for (OMX_U32 i = cancelStart; i < cancelEnd; i++) {
        PortBufferInfo *info = &mOutputBuffers.editItemAt(i);
        err = mNativeWindow->cancelBuffer(
                mNativeWindow.get(), info->gb.get());
        if (err != 0) {
          LOGE("cancelBuffer failed w/ error 0x%08x", err);
          return err;
        }
        info->mStatus = OWNED_BY_NATIVE_WINDOW;
    }

    return err;
}

status_t OMXDecoder::drainInputBuffer(InPortBufferInfo *info) {
    OMX_TICKS ts;
    ts = info->nTimeStamp;
    if (mDebugFlags & DECODER_LATENCY) ts = systemTime() / 1000;
    status_t err = mOMX->emptyBuffer(mNode, info->b_id, 0, info->nFilledLen, OMX_BUFFERFLAG_ENDOFFRAME, ts);
    if (err != OK) {
        LOGD("OMX_EmptyThisBuffer failed:%d", err);
        return err;
    }
    return 0;
}

status_t OMXDecoder::freeOutputBuffers() {
    status_t err = 0;

    for (size_t i = mOutputBuffers.size(); i-- > 0;) {

        if (i < tOutPortDef.nBufferCountActual) {
            err = mOMX->freeBuffer(mNode, OUTPUT_PORT, mOutputBuffers[i].b_id);
            if (err != OK) LOGE("\n\n\n Free Buffer for Output Port buffer:%d failed:%d\n\n\n",i,err);
        }

        // Cancel the buffer if it belongs to an ANativeWindow.
        if (mOutputBuffers[i].mStatus == OWNED_BY_US && mOutputBuffers[i].gb != 0) {
            err = mNativeWindow->cancelBuffer(mNativeWindow.get(), mOutputBuffers[i].gb.get());
            if (err != 0)LOGE("\n\n\nCancel Buffer for Output Port buffer:%d failed:%d\n\n\n",i,err);
        }

        mOutputBuffers.removeAt(i);
    }

    return 0;
}

